<template>
    <div class="auth">
        
      <h2>Нужно нарисовать окно, где будет слева или сверху(на твой вкус) окно навигации, навбар, чтоб ыпо нему можно было переходить по другим окнам </h2>
      <h2>главвное окноо ничего наверное не должно показывать, сам смотри, </h2>
      <h2>еще постарайся сделать всё покрасивше, тот style.css файл нифигово всё отрисовывает, мне понравился </h2>

      <h2>Насчет компонентоов не забудь, конечно, можно и так оставить, и в каждом окне прописывать свойства и прочее, но эт будет долго и геморрно </h2>
      <h2>Еще бы какуюто анимацию добавить, былоо бы секс, навярняка есть какие то готовые решения  </h2>

    </div>
  </template>